
//Маркеры памяти
//void - пустота - космос - ничего - не использует память
//int  - интеджер - целое - память для чисел 12345
//char - символы - буквы
//long - для всего
//------setup - Название
//------() - круглые скобки (SHIFT+9, SHIFT+0) настройки
//------{} - фигурные скобки (SHIFT+Х, SHIFT+Ъ) Начало и конец
//Сложных приказов

//способности  
//говорить 
void  gov(){

}

 //прочитать расписание
 void  provRasp(){
  
 }

 //вывести число 
 void pokaz_chislo(){

 }

 //проверить кнопку
 void knop1(){
  
 }

void setup() {       //-слэш - разрез /слэш в гору \слэш с горы
  
}

void loop() {
 

}
