
//Маркеры памяти
//void - пустота - космос - ничего - не использует память
//int  - интеджер - целое - память для чисел 12345
//char - символы - буквы
//long - для всего
//------setup - Название
//------() - круглые скобки (SHIFT+9, SHIFT+0) настройки
//------{} - фигурные скобки (SHIFT+Х, SHIFT+Ъ) Начало и конец
//Сложных приказов

//способности  
//говорить 
void  gov(){

}
  //проверить время
  void provVrem(){

    
  }    
 //прочитать расписание
 void  provRasp(){
  
 }

 //вывести число 
 void pokaz_chislo(){

 }

 //проверить кнопку
 void knop1(){
  
 }

void setup() {       //-слэш - разрез /слэш в гору \слэш с горы
  int s=0 ;
}

void loop() {
 //переход триггеры

 //состояния
//1.ждёт
if (s==1) {

}

rasp={
  "18:30",
  "19:00"
}
//2.работает
if (s==2) {
  provVrem();
  for (int a=1; a<#rasp; a++ ){
    if 
  }
}


//3.разряжено
if (s==3){

}
